
class AgreementContents {
  final String title;
  final String content;

  AgreementContents({required this.title, required this.content});
}

var agreementContents = [
  AgreementContents(
    title: '會員服務 & 隱私權保護條款',
    content: """
本會員者使用條款策更新於中華民國一一ㄧ年五月
歡迎您成為Florish公司會員（以下簡稱Florish公司或我們）

一、會員帳號、密碼、安全性及資料完整性
  1. 在使用會員服務以前，必須經過完整的註冊及驗證程序，並依照本服務之提示提供您本人正確、最新及完整的資料。
  2. 一旦完成並確認您的會員申請後，您將取得一般會員身份。您可以自由選擇登入Florish心光App瀏覽，您也可以以會員身份訂閱或購買專屬之會員產品、服務或課程，透過會員登入後享有多元的服務體驗及互動過程。
  3. 您在註冊時可以自行選擇一個您所使用的有效電子信箱作為你的登入識別，並由您自行設定密碼。利用該帳號及密碼所進行的一切行動，您將負完全的責任，因此請妥善保管您的密碼。請勿重複申請帳號，並請您提供真實資料，如經查證有違反者，我們有權暫停或終止您全部或部分帳號。
  4. 如果您發現或懷疑您的帳號或密碼遭到盜用、冒用或不當使用或有重複帳號時，請您立即通知我們，以利儘快採取適當之措施。
  5. 請維持並更新您個人資料，確保其為正確、最新及完整。若您提供任何錯誤或不實的資料，Florish公司將無法提供您有效且即時會員服務、新聞資訊或商品訊息、活動訊息。

二、資料儲存
  1. 基於會員經營與管理需要，我們會定期備份您所儲存的資料，以優化會員服務的內容，本公司將依當時本系統所設定之方式及處理能量，定期備份會員所儲存的資料，但不擔保會員所儲存的資料將全部被完整備份；會員同意，本公司不需對未備份、已刪除的資料或備份儲存失敗的資料負責。
  2. 本會員服務不擔保您所上載的資料將被正常顯示、亦不擔保資料傳輸的正確性；如果您發現本會員服務有錯誤或疏失，請立即透過E-mail客服信箱通知本網站管理者。
  3. 本系統會自動偵測一定期間沒有使用的會員帳號，對於一定期間未登入使用之會員帳號，本系統將自動刪除該使用者帳號之所有郵件、檔案、使用者設定資料檔及相關資料，且不予另行備份，並暫停該使用者帳號之使用。有無登入使用之紀錄，以本公司會員服務系統內所留存之紀錄為準。

三、廣告、資訊與內容
  1. Florish公司不定期會與其他公司、廠商等第三人（內容提供者）合作行銷服務，並由各該廣告商、產品與服務的供應商所設計與提供包括文字、圖片、音樂等不同內容，供Florish公司刊登與使用，Florish公司於刊登或使用時均將註明內容提供者。基於尊重內容提供者之智慧財產權，Florish公司對其所提供之內容並不做實質之審查或修改，您對於廣告之正確性與可信度應自行斟酌與判斷。Florish公司僅接受委託予以刊登，不對前述廣告負擔保責任。您若認為某些內容涉及侵權或有所不實，請逕向該內容提供者反應意見。
  2. Florish公司對於您使用本服務或經由Florish公司連結之其他網站而取得之資訊或建議（包括但不限於，商務、投資理財、醫療、法律等方面），不擔保其為完全正確無誤。Florish公司對於本服務所提供之資訊或建議有權隨時修改或刪除。您也許會連結到一些令您厭惡或不需要的網站，遇到此類情形時，建議您不要瀏覽或儘速離開該等網站。您在做出任何相關規劃與決定之前，仍應請教專業人員針對您的情況提出意見，以符合您的個別需求。
  3. 會員同意Florish公司得不定期以會員所登錄的 E-mail 及手機號碼發送資訊、行銷活動之 EDM/SMS、會員專屬電子報、廣告信函、電話訪問或簡訊向您提供一般會員服務。當會員收到訊息後如有拒絕接受行銷之必要，您可以透過E-mail客服信箱表達您的意見，在收到您的通知後，Florish公司會進行會員處理作業，然後停止繼續發送此類訊息，惟會員權益或產品權益相關之通知不在此限。

四、服務內容變更
  1. 部份服務、產品或項目可能係由本公司之合作夥伴所建置或提供、或需由會員進行個別申請或登錄程序、或需由會員付費使用，均依當時及隨後所修改的各該服務網站頻道及服務項目之使用說明及相關頁面而定。
  2. 本公司保留隨時變更免費服務為收費服務、以及變更收費標準之權利，變更後之內容，除公佈於各該網頁外，不另行個別通知。
  3. 部分會員服務可能另訂有相關使用規範或約定，會員應同時遵守各該服務頻道或項目之使用規範及相關約定。
  4. Florish公司將不定期提供各項多元的服務內容，因此我們將視業務需求及實際情形增減、變更或終止相關服務的項目或內容，我們會將修改或變更公布於所經營之於『會員註冊頁』、『會員登入頁』、『設定頁』，我們會經常推出新的服務並請因應服務的類型更新服務條款及政策，建議您隨時透過我們的網站《會員服務條款》注意是否修改或變更版本。您於任何修改或變更後繼續使用本服務，視為您已閱讀、瞭解並同意接受該等修改或變更。如果您不同意本會員服務條款的內容，或者您所屬的國家或地域排除本會員服務條款內容之全部或一部時，您應立即停止使用本服務。

五、會員守法義務
  1. 您必須遵守中華民國相關法規及一切使用網際網路之國際慣例。您若係中華民國以外之使用者，並同意遵守所屬國家或地域之法令。您同意並保證不得利用本服務從事侵害他人權益或違法之行為，包括但不限於：
  2. 公布或傳送任何誹謗、侮辱、具威脅性、攻擊性、不雅、猥褻、不實、違反公共秩序或善良風俗或其他不法之文字、圖片或任何形式的檔案於本服務及本服務所運作之網站上；
  3. 侵害他人名譽、隱私權、營業秘密、商標權、著作權、專利權、其他智慧財產權及其他權利；
  4. 違反依法律或契約所應負之保密義務；
  5. 冒用他人名義使用本服務；
  6. 傳輸或散佈電腦病毒；
  7. 從事不法交易行為或張貼虛假不實、引人犯罪之訊息；
  8. 其他對Florish公司所生之侵權行為。

六、未成年會員權益
為確保兒童及青少年使用網路的安全，並避免隱私權受到侵犯，若您未滿二十歲，除應符合上述規定外，應於您的法定代理人（或監護人）閱讀、瞭解並同意本會員服務條款之所有內容及其後修改變更後，方得使用或繼續使用本服務。當您使用或繼續使用本服務時，即表示您的法定代理人（或監護人）已閱讀、瞭解並同意接受本會員服務條款之所有內容及其後修改變更。如有進行金流交易（例如：產品服務購買等）時，應有法定代理人（或監護人）全程在旁陪伴或完成必要之流程。

七、使用者行為
由會員公開張貼或私下傳送的資訊、資料、文字、軟體、音樂、音訊、照片、圖形、視訊、信息或其他資料（以下簡稱「會員內容」），均由「會員內容」提供者自負責任。Florish公司無法控制經由本服務而張貼之「會員內容」，因此不保証其正確性、完整性或品質。您了解使用本服務時，可能會接觸到令人不快、不適當、令人厭惡之「會員內容」，您使用任何「會員內容」時，就「會員內容」之正確性、完整性或實用性之情形，您同意必須自行加以評估並承擔所有風險。在任何情況下，Florish公司均不為任何「會員內容」負責，包含但不限於任何錯誤或遺漏，以及經由本服務張貼、發送電子郵件或傳送而衍生之任何損失或損害。

八、服務暫停中斷或故障
  1. 本服務有時可能會出現中斷或故障等現象，或許將造成您使用上的不便、資料喪失、錯誤、遭人篡改或其他經濟上損失等情形。您於使用本服務時建議您自行採取防護措施（例如設定保管您的帳號密碼、備份您的資料）。Florish公司對於您因使用（或無法使用）本服務而造成的損害，不負任何賠償責任。包括但不限於下列情形：
  2. 對會員服務相關軟硬體設備進行搬遷、更換、升級、保養或維修時；
  3. 使用者有任何違反政府法令或本會員條款情形；
  4. 天災或其他不可抗力所致之服務停止或中斷；
  5. 對於使用者在使用本服務或使用本服務所致生之任何直接、間接、衍生之財產或非財產之損害；
  6. 使用者對於上傳之文字、圖片及其它資料，應自行備份。對於任何原因導致其內容全部或一部之滅失、毀損；
  7. 其他不可歸責於Florish公司之事由。

九、智慧財產權的保護
Florish公司所使用之軟體或程式、網站上所有內容，包括但不限於著作、圖片、檔案、資訊、資料、網站架構、網站畫面的安排、網頁設計，均由Florish公司或其他權利人依法擁有其智慧財產權，包括但不限於商標權、專利權、著作權、營業秘密與專有技術等。未經同意，您不得逕自使用、修改、重製、公開播送、改作、散布、發行、公開發表、進行還原工程、解編或反向組譯。若您欲引用或轉載前述軟體、程式或內容，必須依法取得Florish公司或其他權利人的事前書面同意。尊重智慧財產權是您應盡的義務，如有違反，您應對Florish公司負損害賠償責任（包括但不限於訴訟費用、律師費用及商譽損失等）。

十、您對Florish公司公司之授權
若您無合法權利得授權他人使用、修改、重製、公開播送、改作、散布、發行、公開發表某資料，並將前述權利轉授權第三人，請勿擅自將該資料上載、傳送、輸入或提供至Florish公司。任何資料一經您上載、傳送、輸入或提供至Florish公司時，視為您已允許Florish公司可以基於公益或私益之目的，無條件使用、修改、重製、公開播送、改作、散布、發行、公開發表該等資料，並得將前述權利轉授權他人，您對此絕無異議。您並應保證Florish公司使用、修改、重製、公開播送、改作、散布、發行、公開發表、轉授權該等資料，不致侵害任何第三人之智慧財產權，否則應對Florish公司負損害賠償責任（包括但不限於訴訟費用、律師費用及商譽損失等）。

十一、會員身份終止與本公司通知之義務
  1. Florish公司具有更改各項服務內容或終止任一會員帳戶服務之權利。
  2. 若會員決定終止本公司會員資格，可直接以電子郵件的方式通知本公司或是由本公司所提供之機制進行取消，本公司將儘快註銷您的會員資料。
  3. 會員有通知取消本公司會員資格之義務，並自停止本公司會員身份之日起（以本公司電子郵件發出日期為準），喪失所有本服務所提供之優惠及權益。
  4. 為避免惡意情事發生致使會員應享權益損失，當會員通知本公司停止會員身份時，本公司將再次以電子郵件確認無誤後，再進行註銷會員資格。

十二、終止服務
  1. 基於公司運作，本公司保留隨時停止提供會員服務之全部或一部之權利，除對於付費服務按比例退還已收取而未使用之費用外，本公司不因此而對會員負賠償或補償之責任。
  2. 如會員違反本使用條款或各該會員服務之使用規範或約定，本公司保留隨時暫時停止提供服務、或終止提供服務之權利，且不因此而對會員負任何賠償或補償之責任。

十三、準據法與管轄法院
本會員服務條款之解釋與適用，以及與本會員服務條款有關的爭議，均應依照中華民國法律及相關規範予以處理，並以台灣高雄地方法院為第一審管轄法院。本網站的任何聲明、條款如有未盡完善之處，將以最大誠意，依誠實信用、平等互惠原則，共商解決之道。

十四、個人資料保護告知暨同意事項
蒐集之目的：在於進行行銷、商品、採購與供應管理、統計及調查分析、會計與相關服務、最新資訊與資料庫管理、會員活動服務、信用卡或轉帳卡之管理及其他合於營業登記項目或章程所定業務之需要（以下稱蒐集目的）。我們將上開蒐集目的消失前，在臺灣地區或完成上開蒐集目的之必要地區內，蒐集、處理、利用或國際傳輸您填載於Florish公司會員申請書之個人資料或日後經您同意而提供之其他個人資料。在上開蒐集目的範圍內，我們可能會將您全部或部分個人資料提供予關係企業或合作廠商。
蒐集之類別：
  1. 辨識個人者： 包括會員之姓名、地址、電話、電子郵件、網路平台帳號、行動電話等資訊。
  2. 其他項目：如App留言、App收藏、瀏覽、點擊、系統自動記錄之軌跡資訊等。
  3. 如有其他個資項目蒐集，Florish公司將另以其他方式通知並取得同意。
利用期間、地區、對象及方式：
  1. 期間：在您要求停止使用或Florish公司停止提供服務之日為止。
  2. 地區：Florish公司營運地區內。
  3. 利用對象及方式：會員之個人資料蒐集除用於Florish公司之會員管理、客戶管理之檢索查詢等功能外，亦將利用於辨識身份、金流服務、物流服務、行銷廣宣等。
會員就個人資料之權利：您有權利對於個人資料隨時請求查詢、閱覽、製給複製本、補充或更正，或停止蒐集、處理或利用及請求刪除。您如欲行使上述權利，可與Florish公司客服連絡，Florish公司並得依據作業需求收取費用。會員如欲行使上述權利，可與Florish公司客服連絡進行申請。
  - 服務信箱：service@florish.cc
  - 服務時間：週一～週五：09:00~17:30
您了解並同意，在您要求停止使用或Florish公司停止提供服務之日為止，Florish公司將於前揭特定目的範圍內利用您的個人資料。除非經您同意或符合下列情形外，不會將您的個人資料揭露予委外服務廠商以外之第三人或為特定目的外利用：
  1. 法律明文規定，或司法機關或有權調閱資料之公務機關依法定程序請求查閱；
  2. 為增進公共利益所必要；
  3. 為免除當事人之生命、身體、自由或財產上之危險；
  4. 為防止他人權益之重大危害；
  5. 有利於當事人權益。


隱私權保護政策
本隱私權政策更新於中華民國一一一年五月
Florish公司提供您透過裝置上的應用程式（以下簡稱：App）、API 以及透過協力廠商等，存取Florish公司提供之服務（下稱：本服務）。Florish公司絕對尊重並保護用戶的個人隱私權，為保障您的權益，並打造更佳的服務，協助您清楚地瞭解本服務如何蒐集、應用及保護您所提供的個人資料，在您開始使用Florish心光App前，請先詳讀本隱私權保護政策與使用條款（以下簡稱：本政策）。

一、保護範圍
本隱私權保護政策適用於您在使用本服務過程中，涉及個人資料蒐集、處理、利用與保護之相關作法。
本隱私權政策適用Florish公司所有服務，包括所屬應用程式Florish心光App；不適用於本網站以外的相關連結網站 ，也不適用於非本網站所委託或參與管理的人員。
以上服務，我們保留修改的權利，如有更改將不定時公告。

二、個人資料蒐集資料目的、蒐集類型及蒐集與使用方式
蒐集目的：Florish公司基於各網站或會員服務或其他網站提供之相關服務包括對於客戶、會員管理與服務、行銷與廣告業務、統計及研究分析、網路購物或其他電子商務服務與調查或章程所定業務需要之特定目的，使用以下方式蒐集您的個人資料。
蒐集之個人資料類別：Florish公司於網站內蒐集的個人資料包括
  1. 辨識個人者： 包括會員之姓名、地址、電話、電子郵件、網路平台帳號、行動電話等資訊。
  2. 其他項目：如App留言、App收藏、瀏覽、點擊、系統自動記錄之軌跡資訊等。
  3. 如有其他個資項目蒐集，Florish公司將另以其他方式通知並取得同意。

以上所實際蒐集之資料類別依註冊或使用時所要求提供之個人資料類別為準。
個人資料蒐集方式：
  1. 當您註冊會員時，我們會蒐集您的個人資料，例如：姓名、電子信箱、手機，以便為您提供會員服務。
  2. 當您購買商品或課程時，您必須先註冊成為Florish公司會員，再進行消費。我們會蒐集您的姓名、電子信箱、手機、地址，以便後續為您派送商品、贈品或課程券。
  3. 來自第三方，我們會從與我們合作的第三方，包括廣告商與合作夥伴，蒐集到有關您的個人資料。如屬於Florish公司各事業單位與其他合作夥伴聯名或共同蒐集時，我們將於共同蒐集之活動或課程中載明，只有當您同意第三方或Florish公司進行資料分享、或註冊成為會員時，我們才會使用。
  4. Google 服務：我們所提供的部分服務（App），有可能會使用 Google Analytics （分析）與 Google 廣告功能（以下稱 Google 服務），藉由 Google 服務蒐集並回傳給我們的數據資料，作為改善Florish公司服務品質及提供 Google 廣告用途。我們也會將這些數據資料（不含直接可識別您個人的資料）提供給我們數位服務的合作夥伴，共同改善我們提供的服務。

個人資料利用期間、地區：
期間：除另有約定外，我們將利用您的資料直到您請求停止使用或Florish公司停止提供服務之日止。

利用對象及方式：包括Florish公司及其他委外廠商（例如提供物流、金流之廠商）
  1. 提供個人化的服務，包括內容和廣告 - 我們會用您所提供的個人資料，為您打造個人化的服務，包括個人化內容或建議活動。例如：若您過去曾參與某一系列活動，代表您對該活動有興趣，當該活動有最新消息，我們會優先知會予您。依據您的設定，Florish公司第三方服務可能會根據您的興趣向您顯示個人化廣告。
  2. 評估成效 - 為了解本服務的使用情形，我們會蒐集並分析資料。我們會運用 Google Analytics（分析）等工具分析，而這些分析結果將用來改善服務，為您提供更佳的內容。

我們非常歡迎您直接加入「Florish公司會員」，基於確認身份、提供會員服務及相關行銷需求，我們會要求您完成登入、註冊及驗證程序，以便隨時提供您Florish公司多元的優惠方案及福利活動和享受更多會員旅程。

三、分享您的個人資料
我們不會在未經您同意的狀況下向任何人或公司出售或出借您的個人資料。但在某些情況下會有例外。這些狀況包括（但不限於）：
  1. 服務供應商：我們會與提供技術基礎架構的服務供應商合作，尤其是代管、儲存、管理及維護Florish公司 App、內容以及我們所處理的資料的供應商，以便Florish公司所有服務順利運作。
  2. 合作夥伴：依據您註冊Florish公司服務的方式（例如透過第三方服務或行動電信業者），我們會視需要分享您的使用者名稱，或其他帳戶註冊資料以啟用您的帳戶。我們也會以去識別化的格式，與協助我們進行促銷活動的行銷合作夥伴，以及讓我們提供免費服務的廣告商分享您的個人資料。
  3. 司法單位或其他有權機關因公眾安全，要求本網站公開特定個人資料時，本網站將視司法單位合法正式的程序，以及對本網站所有使用者安全考量下做可能必要的配合時。

四、個人資料權利行使方式
依個人資料保護第 3 條規定，您可行使以下權利
  1. 請求查詢或請求閱覽
  2. 製給複製本
  3. 補充或更正
  4. 請求停止蒐集、處理或利用
  5. 請求刪除

您可以與Florish公司聯絡請求行使上述權利。上述權利之行使，Florish公司可能依法酌收必要成本費用，若因不符合申請程序、法律規定、本服務依法負有保存義務或法律另有規定之情況者，則可能無法依您的要求辦理。此外，Florish公司提供之網站包含部分公開討論資訊 （例如：發表留言或提問等，可自由輸入任何文字或上傳圖片以提供網友互動，此類行為Florish公司並無權控制，因此您所填寫的資料可能經由其他有心人士利用，請您特別注意個人資料的妥善保護。

五、資料安全保護承諾
您的個人資料保管在中華民國，均依照中華民國法律予以處理，並以台灣高雄地方法院為第一審管轄法院。我們致力為您的個人資料提供妥善保護，並採取適當的技術與安全維護措施來協助保護您的個人資料安全。

六、隱私權政策的異動
本隱私權政策會為因應社會環境及法令規定變遷於在最短時間內更新。如果您對「Florish公司」網站的隱私權政策或與個人資料有任何疑問，歡迎您使用App與「Florish公司」連絡。

七、如何與我們聯絡
如果您對Florish公司服務或本政策有任何疑問或行使個人權益，請利用以下方式與Florish公司聯絡：
  - 服務信箱：service@florish.cc
  - 服務時間：週一～週五：09:00~17:30

感謝您閱讀並同意我們的條款。希望您能盡情享受Florish公司所提供的服務！本APP上有可能包含其他合作網站或網頁連結，該網站或網頁也有可能會蒐集您的個人資料，不論其內容或隱私權政策為何，皆與本APP 無關，您應自行參考該連結網站中的隱私權保護政策，我們不負任何連帶責任。

""",
  ),
];
